:PROPERTIES:
:ID:       bf51c987-41db-4922-aaba-57393fa6454b
:END:
#+title: Readinglist
#+todo: WAIT(w)  READING(r!)  | READ(d)
#+todo: STUDING(s) | COMPLETE(C)
#+todo: WATCHING(W) | WATCHED(T)

#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

# C-c C-x C-c カラムビュー
# Special propertiesを指定できる。Special propertiesに書かれているものは引き出し内で使わないこと

* Comic
  :PROPERTIES:
  :ARCHIVE:  %s_archive::* Comic
  :COLUMNS:  %ITEM(Name) %CLOSED %TODO %ALLTAGS
  :CATEGORY: COMIC
  :END:

** READING [[id:a115260d-0001-4589-a716-dae51a81c7e4][不揃いの連理]] 7巻
- Added: [2023-01-10 Tue 23:16]


** READING [[id:f096b5a8-95c7-484f-9847-ecc94ea4549d][明日ちゃんのセーラー服]] 5巻
- Added: [2023-01-10 Tue 23:24]
* Book
  :PROPERTIES:
  :ARCHIVE:  %s_archive::* Book
  :END:
** READING [[id:cec06044-183b-45c6-bfe4-51a7e37b61a8][ラブライブ! School idol diary_novel]] 高坂穂乃果
:LOGBOOK:
CLOCK: [2023-01-08 Sun 12:43]--[2023-01-08 Sun 12:58] =>  0:15
- スクールアイドルになろう。
CLOCK: [2023-01-07 Sat 12:03]--[2023-01-07 Sat 12:14] =>  0:11
- 穂乃果はあきらめない。
- State "READING"    from "WAIT"       [2023-01-07 Sat 01:18]
:END:
** READING [[id:ea107a48-764b-4194-b20a-4fb72dc1669d][マクニール世界史]] 下巻
:LOGBOOK:
- State "READ"       from "READING"    [2022-12-29 Thu 19:58] \\
  p199-216
- State "READ"       from "READING"    [2022-12-27 Tue 22:36] \\
  25 ヨーロッパ旧体制へのアジアの反応
- State "READ"       from "READING"    [2022-12-27 Tue 00:09] \\
  25 ヨーロッパ旧体制へのアジアの反応
- State "TODO"       from              [2022-11-26 Sat 21:45]
:END:
** [[id:82200332-bf26-4f11-9471-a7c41476f95f][ダーティペアの大冒険]]
:LOGBOOK:
CLOCK: [2022-07-19 Tue 00:04]--[2022-07-19 Tue 00:30] =>  0:26
CLOCK: [2022-07-17 Sun 01:42]--[2022-07-17 Sun 02:15] =>  0:33
:END:
** READING [[id:f21073d1-167f-4ce8-bd65-4e7581f06172][私の初恋相手がキスしてた]] 3巻
** READING [[id:cad06e07-6ea9-44d8-9832-2cbda69977eb][私の好きな孤独]]
:LOGBOOK:
CLOCK: [2023-01-08 Sun 08:17]--[2023-01-08 Sun 08:29] =>  0:12
- -P145
CLOCK: [2023-01-07 Sat 23:30]--[2023-01-07 Sat 23:44] =>  0:14
- -P131
CLOCK: [2023-01-07 Sat 11:19]--[2023-01-07 Sat 11:57] =>  0:38
- P85-121
CLOCK: [2023-01-06 Fri 23:01]--[2023-01-06 Fri 23:14] =>  0:13
- P75-85
CLOCK: [2023-01-04 Wed 18:01]--[2023-01-04 Wed 18:18] =>  0:17
- P60-75
CLOCK: [2023-01-04 Wed 11:59]--[2023-01-04 Wed 12:35] =>  0:36
- P25-60
- State "READING"    from "WAIT"       [2023-01-03 Tue 20:53]
CLOCK: [2023-01-03 Tue 20:53]--[2023-01-03 Tue 21:11] =>  0:18
- -P24
:END:
** READING [[id:49cd19f8-a3a9-40fa-9d4a-ed2d7b02ae51][安達としまむら]] 11巻
 - Added: [2023-01-10 Tue 23:25]
* Study
  :PROPERTIES:
  :ARCHIVE:  %s_archive::* Study
  :END:
** 解析学
:LOGBOOK:
CLOCK: [2022-08-28 Sun 14:39]--[2022-08-28 Sun 15:57] =>  1:18
CLOCK: [2022-08-27 Sat 11:06]--[2022-08-27 Sat 11:51] =>  0:45
CLOCK: [2022-08-21 Sun 16:25]--[2022-08-21 Sun 16:36] =>  0:11
CLOCK: [2022-08-21 Sun 14:10]--[2022-08-21 Sun 14:44] =>  0:34
CLOCK: [2022-08-21 Sun 13:46]--[2022-08-21 Sun 14:06] =>  0:20
CLOCK: [2022-08-20 Sat 22:01]--[2022-08-20 Sat 23:00] =>  0:59
CLOCK: [2022-08-19 Fri 10:02]--[2022-08-19 Fri 11:03] =>  1:01
CLOCK: [2022-08-18 Thu 20:57]--[2022-08-18 Thu 21:24] =>  0:27
CLOCK: [2022-08-09 Tue 22:31]--[2022-08-09 Tue 23:16] =>  0:45
CLOCK: [2022-08-08 Mon 23:48]--[2022-08-09 Tue 00:33] =>  0:45
CLOCK: [2022-08-07 Sun 15:19]--[2022-08-07 Sun 16:55] =>  1:36
CLOCK: [2022-08-06 Sat 14:40]--[2022-08-06 Sat 15:39] =>  0:59
CLOCK: [2022-07-31 Sun 18:43]--[2022-07-31 Sun 19:17] =>  0:34
CLOCK: [2022-07-31 Sun 11:54]--[2022-07-31 Sun 12:34] =>  0:40
CLOCK: [2022-07-30 Sat 22:39]--[2022-07-31 Sun 00:05] =>  1:26
CLOCK: [2022-07-30 Sat 21:10]--[2022-07-30 Sat 21:30] =>  0:20
CLOCK: [2022-07-30 Sat 15:44]--[2022-07-30 Sat 16:33] =>  0:49
CLOCK: [2022-07-30 Sat 08:23]--[2022-07-30 Sat 09:12] =>  0:49
CLOCK: [2022-07-29 Fri 10:32]--[2022-07-29 Fri 10:44] =>  0:12
CLOCK: [2022-07-25 Mon 23:23]--[2022-07-26 Tue 01:08] =>  1:45
CLOCK: [2022-07-24 Sun 13:05]--[2022-07-24 Sun 14:04] =>  0:59
CLOCK: [2022-07-23 Sat 16:55]--[2022-07-23 Sat 17:15] =>  0:20
CLOCK: [2022-07-23 Sat 13:26]--[2022-07-23 Sat 14:32] =>  1:06
CLOCK: [2022-07-23 Sat 09:11]--[2022-07-23 Sat 09:40] =>  0:29
CLOCK: [2022-07-22 Fri 23:45]--[2022-07-23 Sat 00:06] =>  0:21
CLOCK: [2022-07-21 Thu 20:45]--[2022-07-21 Thu 21:09] =>  0:24
CLOCK: [2022-07-20 Wed 22:52]--[2022-07-20 Wed 23:35] =>  0:43
CLOCK: [2022-07-19 Tue 10:30]--[2022-07-19 Tue 10:43] =>  0:13
CLOCK: [2022-07-17 Sun 09:36]--[2022-07-17 Sun 10:27] =>  0:51
CLOCK: [2022-07-16 Sat 19:20]--[2022-07-16 Sat 19:30] =>  0:10
:END:
*** III 複素変数の関数
:LOGBOOK:
CLOCK: [2022-11-13 Sun 19:39]--[2022-11-13 Sun 20:06] =>  0:27
CLOCK: [2022-11-10 Thu 21:48]--[2022-11-10 Thu 22:17] =>  0:29
CLOCK: [2022-10-31 Mon 23:06]--[2022-10-31 Mon 23:48] =>  0:42
CLOCK: [2022-10-30 Sun 09:04]--[2022-10-30 Sun 10:26] =>  1:22
CLOCK: [2022-10-09 Sun 11:05]--[2022-10-09 Sun 11:39] =>  0:34
CLOCK: [2022-09-25 Sun 14:50]--[2022-09-25 Sun 16:12] =>  1:22
CLOCK: [2022-09-18 Sun 11:07]--[2022-09-18 Sun 12:04] =>  0:57
CLOCK: [2022-09-17 Sat 17:37]--[2022-09-17 Sat 18:28] =>  0:51
CLOCK: [2022-09-17 Sat 10:07]--[2022-09-17 Sat 11:12] =>  1:05
CLOCK: [2022-09-04 Sun 09:05]--[2022-09-04 Sun 10:03] =>  0:58
CLOCK: [2022-09-03 Sat 09:08]--[2022-09-03 Sat 11:05] =>  1:57
CLOCK: [2022-09-02 Fri 09:55]--[2022-09-02 Fri 11:20] =>  1:25
CLOCK: [2022-09-02 Fri 01:04]--[2022-09-02 Fri 01:44] =>  0:40
CLOCK: [2022-08-30 Tue 21:49]--[2022-08-30 Tue 22:41] =>  0:52
CLOCK: [2022-08-29 Mon 23:22]--[2022-08-30 Tue 00:36] =>  1:14
- State "TODO"       from              [2022-08-29 Mon 23:22]
:END:

** Automate the Boring Stuff with Python
:LOGBOOK:
CLOCK: [2022-08-06 Sat 21:12]--[2022-08-06 Sat 21:47] =>  0:35
CLOCK: [2022-08-04 Thu 23:45]--[2022-08-05 Fri 00:12] =>  0:27
:END:
[[https://automatetheboringstuff.com/2e/chapter0/][Automate the Boring Stuff with Python]]
** LATEX2e美文書作成入門
:LOGBOOK:
CLOCK: [2022-08-27 Sat 18:35]--[2022-08-27 Sat 18:59] =>  0:24
CLOCK: [2022-08-21 Sun 08:15]--[2022-08-21 Sun 08:33] =>  0:18
CLOCK: [2022-08-20 Sat 18:17]--[2022-08-20 Sat 18:38] =>  0:21
CLOCK: [2022-08-20 Sat 13:26]--[2022-08-20 Sat 15:03] =>  1:37
- State "TODO"       from              [2022-08-18 Thu 18:23]
:END:
[[id:01b765b4-755b-466b-af9c-bbba4ec727d4][LaTex2e美文書作成入門]]
** STUDING いちばんやさしいITパスポート
:LOGBOOK:
CLOCK: [2023-01-02 Mon 14:27]--[2023-01-02 Mon 14:50] =>  0:23
- 3章再読
- State "COMPLETE"   from "STUDING"    [2023-01-01 Sun 19:06] \\
  2章再読
- State "READ"       from "STUDING"    [2022-12-25 Sun 11:57] \\
  1章再読
- State "READ"       from "STUDING"    [2022-12-22 Thu 00:45] \\
  15章。通読完了。令和4年過去問
- State "READ"       from "STUDING"    [2022-12-20 Tue 01:10] \\
  15章前半と過去問
- State "READ"       from "STUDING"    [2022-12-17 Sat 15:48] \\
  14章
- State "READ"       from "STUDING"    [2022-12-17 Sat 15:06] \\
  13章
- State "READ"       from "STUDING"    [2022-12-17 Sat 00:10] \\
  12章
:END:
[[id:52e04a48-7b80-4d21-b0d8-e94bcc83a28a][ITパスポート試験]]
** Pythonによるデータ分析入門
:LOGBOOK:
CLOCK: [2022-09-03 Sat 12:07]--[2022-09-03 Sat 12:36] =>  0:29
CLOCK: [2022-09-02 Fri 13:35]--[2022-09-02 Fri 15:03] =>  1:28
- State "TODO"       from              [2022-09-02 Fri 13:35]
:END:

** 数値解析入門
:LOGBOOK:
CLOCK: [2022-11-12 Sat 11:21]--[2022-11-12 Sat 12:35] =>  1:14
CLOCK: [2022-11-05 Sat 16:29]--[2022-11-05 Sat 18:03] =>  1:34
CLOCK: [2022-10-30 Sun 12:58]--[2022-10-30 Sun 13:11] =>  0:13
CLOCK: [2022-10-30 Sun 11:27]--[2022-10-30 Sun 11:53] =>  0:26
- State "TODO"       from              [2022-10-30 Sun 11:27]
:END:


** STUDING English
SCHEDULED: <2022-12-18 Sun .+1d/2d>
:PROPERTIES:
:LOGGING:  READ(@) logrepeat
:STYLE:    habit
:LAST_REPEAT: [2022-12-17 Sat 00:13]
:END:
:LOGBOOK:
- State "READ"       from "STUDING"    [2022-12-17 Sat 00:13] \\
  dialogue1800 4-38
:END:

* Anime
:PROPERTIES:
:ARCHIVE:  %s_archive::* Anime
:END:
** WATCHING [[id:ca897c94-7e1e-4809-b449-be16360247c5][ラブライブ！]] 2nd
:LOGBOOK:
CLOCK: [2023-01-09 Mon 00:17]--[2023-01-09 Mon 00:41] =>  0:24
- 9話
CLOCK: [2023-01-07 Sat 18:21]--[2023-01-07 Sat 18:51] =>  0:30
- 2-8
:END:
** WATCHING [[id:a1bc8d62-4060-451a-b392-1e54a2269c49][デリシャスパーティプリキュア]]
:LOGBOOK:
CLOCK: [2023-01-08 Sun 08:30]--[2023-01-08 Sun 08:59] =>  0:29
- 42話
:END:
* ClockTable
[[https://orgmode.org/manual/The-clock-table.html][The clock table (The Org Manual)]]
# Blockとtstart/tendは併用できない?
#+BEGIN: clocktable  :scope file-with-archives   :timestamp nil :maxlevel 3  :stepskip0 t  :properties("CLOSED" "VOLUME") :inherit-props t :block untilnow :step year

Annual report starting on: [2022-01-01 Sat]
| CLOSED                 | VOLUME | Headline                                        |       Time |          |       |
|------------------------+--------+-------------------------------------------------+------------+----------+-------|
|                        |        | *Total time*                                    | *8d 21:42* |          |       |
|------------------------+--------+-------------------------------------------------+------------+----------+-------|
|                        |        | Comic                                           |      10:11 |          |       |
|                        |        | \_  アンドロイドは経験人数に入りますか？        |            |     0:29 |       |
| [2022-09-17 Sat]       |        | \_    2巻                                       |            |          |  0:05 |
|                        |        | \_  くちべた食堂                                |            |     0:24 |       |
| [2022-08-14 Sun]       |        | \_    2巻                                       |            |          |  0:24 |
|                        |        | \_  たえちゃんとじみこさん                      |            |     2:04 |       |
| [2022-07-19 Tue]       |        | \_    1巻                                       |            |          |  1:17 |
| [2022-09-24 Sat]       |        | \_    2巻                                       |            |          |  0:47 |
|                        |        | \_  ちょっといっぱい！                          |            |     0:22 |       |
| [2022-09-17 Sat]       |        | \_    9巻                                       |            |          |  0:22 |
|                        |        | \_  ひなたのひより                              |            |     0:19 |       |
| [2022-07-16 Sat]       |        | \_    1巻                                       |            |          |  0:19 |
|                        |        | \_  プリキュアコレクション                      |            |     0:50 |       |
| [2022-08-18 Thu]       |        | \_    プリンセスプリキュア                      |            |          |  0:50 |
|                        |        | \_  ラブライブ!スーパースター!! 2人の時間!      |            |     0:16 |       |
| [2022-10-12 Wed]       |        | \_    1巻                                       |            |          |  0:11 |
| [2022-10-13 Thu]       |        | \_    2巻                                       |            |          |  0:05 |
|                        |        | \_  雨夜の月                                    |            |     1:31 |       |
| [2022-08-04 Thu]       |        | \_    1巻                                       |            |          |  0:31 |
| [2022-08-06 Sat]       |        | \_    2巻                                       |            |          |  0:34 |
| [2022-09-25 Sun]       |        | \_    3巻                                       |            |          |  0:26 |
|                        |        | \_  黄道寮の星座な日々                          |            |     0:41 |       |
| [2022-09-12 Mon]       |        | \_    1巻                                       |            |          |  0:41 |
|                        |        | \_  今日はカノジョがいないから                  |            |     0:55 |       |
|                        |      1 | \_    1巻                                       |            |          |  0:25 |
| [2022-08-18 Thu]       |        | \_    2巻                                       |            |          |  0:30 |
|                        |        | \_  姉の親友、私の恋人。                        |            |     0:48 |       |
| [2022-09-24 Sat]       |        | \_    1巻                                       |            |          |  0:30 |
| [2022-09-25 Sun]       |        | \_    2巻                                       |            |          |  0:18 |
|                        |        | \_  邪神ちゃんドロップキック                    |            |     0:11 |       |
| [2022-08-13 Sat]       |        | \_    1巻                                       |            |          |  0:11 |
|                        |        | \_  明日ちゃんのセーラー服                      |            |     1:21 |       |
| [2022-10-23 Sun]       |        | \_    2巻                                       |            |          |  0:37 |
| [2022-10-23 Sun]       |        | \_    3巻                                       |            |          |  0:28 |
| [2022-11-09 Wed]       |        | \_    4巻                                       |            |          |  0:16 |
|                        |        | Book                                            |      22:26 |          |       |
|                        |        | \_  マクニール 世界史                           |            |    15:49 |       |
| [2022-11-26 Sat]       |        | \_    上巻                                      |            |          | 15:49 |
|                        |        | \_  ダーティペア                                |            |     0:59 |       |
|                        |        | \_    ダーティペアの大冒険                      |            |          |  0:59 |
|                        |        | \_  スーパーカブ                                |            |     2:23 |       |
| [2022-12-14 Wed]       |        | \_    3巻                                       |            |          |  2:23 |
|                        |        | \_  私の初恋相手がキスしてた                    |            |     3:15 |       |
| [2022-07-25 Mon]       |        | \_    2巻                                       |            |          |  3:15 |
|                        |        | Study                                           |   1d 21:52 |          |       |
|                        |        | \_  解析学                                      |            | 1d 12:46 |       |
|                        |        | \_    III 複素変数の関数                        |            |          | 14:55 |
|                        |        | \_  Automate the Boring Stuff with Python       |            |     1:02 |       |
|                        |        | \_  LATEX2e美文書作成入門                       |            |     2:40 |       |
|                        |        | \_  Pythonによるデータ分析入門                  |            |     1:57 |       |
|                        |        | \_  数値解析入門                                |            |     3:27 |       |
|------------------------+--------+-------------------------------------------------+------------+----------+-------|
|                        |        | Book                                            |    5d 5:19 |          |       |
| [2022-07-28 Thu 00:01] |        | \_  21世紀の道徳                                |            |     7:20 |       |
| [2022-07-29 Fri 09:40] |        | \_  エンジニアのための時間管理術                |            |     3:28 |       |
| [2022-08-28 Sun 09:50] |        | \_  あなたが救える命                            |            |     8:29 |       |
| [2022-08-19 Fri 21:16] |        | \_  新しい貧困                                  |            |    11:44 |       |
| [2022-08-13 Sat 09:01] |        | \_  働くことの哲学                              |            |     7:49 |       |
| [2022-08-06 Sat 12:12] |        | \_  良き人生について                            |            |    10:05 |       |
| [2022-09-03 Sat 20:34] |        | \_  緒方貞子 私の仕事                           |            |    13:39 |       |
| [2022-09-09 Fri 22:23] |        | \_  難民に希望の光を 真の国際人緒方貞子の生き方 |            |     4:36 |       |
| [2022-09-11 Sun 21:55] |        | \_  置かれた場所で咲きなさい                    |            |     2:18 |       |
| [2022-09-18 Sun 00:47] |        | \_  国際政治~恐怖と絶望~                        |            |     8:33 |       |
| [2022-09-25 Sun 11:35] |        | \_  橋をかける                                  |            |     2:03 |       |
|                        |        | \_  モラル・トライブズ                          |            |    20:10 |       |
| [2022-09-27 Tue 21:36] |        | \_    上巻                                      |            |          | 11:57 |
| [2022-10-11 Tue 00:53] |        | \_    下巻                                      |            |          |  8:13 |
| [2022-10-23 Sun 14:59] |        | \_  山県有朋                                    |            |     8:19 |       |
| [2022-11-09 Wed 17:50] |        | \_  ゴルギアス                                  |            |     9:28 |       |
| [2022-11-20 Sun 21:58] |        | \_  パイドロス                                  |            |     7:18 |       |
|                        |        | Comic                                           |       5:53 |          |       |
|                        |        | \_  神絵師JKとOL腐女子                          |            |     0:34 |       |
| [2022-07-17 Sun 13:43] |        | \_    5巻                                       |            |          |  0:34 |
|                        |        | \_  欠けた月とドーナッツ                        |            |     0:29 |       |
| [2022-07-17 Sun 18:14] |        | \_    4巻                                       |            |          |  0:29 |
| [2022-08-16 Tue 14:19] |        | \_  ゆいここ？ここらん？                        |            |     0:10 |       |
| [2022-10-06 Thu 21:29] |        | \_  らんらんってここぴーのこと好きだったの！？  |            |     0:10 |       |
| [2022-11-13 Sun 14:46] |        | \_  ねこだまり                                  |            |     0:24 |       |
| [2022-11-08 Tue 00:02] |        | \_    1巻                                       |            |          |  0:24 |
|                        |        | \_  ロンリーガールに逆らえない                  |            |     4:06 |       |
| [2022-08-21 Sun 16:24] |        | \_    1巻                                       |            |          |  0:22 |
| [2022-08-21 Sun 16:24] |        | \_    2巻                                       |            |          |  1:17 |
| [2022-08-21 Sun 16:24] |        | \_    3巻                                       |            |          |  0:48 |
| [2022-08-23 Tue 21:58] |        | \_    4巻                                       |            |          |  1:09 |
| [2022-08-27 Sat 15:31] |        | \_    5巻                                       |            |          |  0:30 |
|                        |        | Study                                           |       4:01 |          |       |
| [2022-08-08 Mon 22:45] |        | \_  C言語ポインタ完全制覇                       |            |     4:01 |       |

Annual report starting on: [2023-01-01 Sun]
| CLOSED           | VOLUME | Headline                          |    Time |      |      |
|------------------+--------+-----------------------------------+---------+------+------|
|                  |        | *Total time*                      | *13:16* |      |      |
|------------------+--------+-----------------------------------+---------+------+------|
|                  |        | Comic                             |    2:56 |      |      |
|                  |        | \_  ラブライブ! School idol diary |         | 1:13 |      |
| [2023-01-04 Wed] |        | \_    綾瀬絵里                    |         |      | 1:13 |
|                  |        | \_  今日もカレーですか？          |         | 1:07 |      |
| [2023-01-03 Tue] |        | \_    4巻                         |         |      | 1:07 |
|                  |        | \_  先輩、美味しいですか？        |         | 0:36 |      |
| [2023-01-04 Wed] |        | \_    2巻                         |         |      | 0:36 |
|                  |        | Book                              |    3:11 |      |      |
|                  |        | \_  国家                          |         | 2:00 |      |
|                  |        | \_    下巻                        |         |      | 2:00 |
|                  |        | \_  私の好きな孤独                |         | 1:11 |      |
|                  |        | Study                             |    0:23 |      |      |
|                  |        | \_  いちばんやさしいITパスポート  |         | 0:23 |      |
|                  |        | Anime                             |    3:07 |      |      |
|                  |        | \_  ストロベリー・パニック        |         | 3:07 |      |
|------------------+--------+-----------------------------------+---------+------+------|
|                  |        | Book                              |    3:13 |      |      |
| [2023-01-03 Tue] |        | \_  ある一生                      |         | 3:13 |      |
|                  |        | Comic                             |    0:26 |      |      |
|                  |        | \_  北陸とらいあんぐる [6/6]      |         | 0:26 |      |
| [2023-01-02 Mon] |      6 | \_    6巻                         |         |      | 0:26 |
#+END:


# Local Variables:
# org-use-property-inheritance: ("TITLE" "NOTE")
# End:
